# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

x = int(input())
a = int(x / 100)
b = int((x - a * 100) / 10)
c = x - a * 100 - b * 10

print(a + b + c)